FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32Hal/src/STM32HalPwmService.cpp
#include "Stm32HalConf.h"
#include "Stm32HalPwmService.h"
#include <algorithm>
#include <math.h>
#include "Stm32HalTimer.h"

namespace Stm32
{
    struct TimAndChannel
    {
        unsigned char TimNum;
        TIM_TypeDef *TIM;
        unsigned short TIM_Channel;
    };

	TimAndChannel Stm32HalPwmPinToTimAndChannel(unsigned short pin)
	{
		switch (pin)
		{
#ifdef PWM_TIM1_CC1
		case PWM_TIM1_CC1 : 
            return {1, TIM1, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM1_CC2
		case PWM_TIM1_CC2 : 
            return {1, TIM1, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM1_CC3
		case PWM_TIM1_CC3 : 
            return {1, TIM1, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM1_CC4
		case PWM_TIM1_CC4 : 
            return {1, TIM1, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM2_CC1
		case PWM_TIM2_CC1 : 
            return {2, TIM2, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM2_CC2
		case PWM_TIM2_CC2 : 
            return {2, TIM2, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM2_CC3
		case PWM_TIM2_CC3 : 
            return {2, TIM2, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM2_CC4
		case PWM_TIM2_CC4 : 
            return {2, TIM2, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM3_CC1
		case PWM_TIM3_CC1 : 
            return {3, TIM3, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM3_CC2
		case PWM_TIM3_CC2 : 
            return {3, TIM3, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM3_CC3
		case PWM_TIM3_CC3 : 
            return {3, TIM3, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM3_CC4
		case PWM_TIM3_CC4 : 
            return {3, TIM3, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM4_CC1
		case PWM_TIM4_CC1 : 
            return {4, TIM4, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM4_CC2
		case PWM_TIM4_CC2 : 
            return {4, TIM4, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM4_CC3
		case PWM_TIM4_CC3 : 
            return {4, TIM4, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM4_CC4
		case PWM_TIM4_CC4 : 
            return {4, TIM4, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM5_CC1
		case PWM_TIM5_CC1 : 
            return {5, TIM5, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM5_CC2
		case PWM_TIM5_CC2 : 
            return {5, TIM5, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM5_CC3
		case PWM_TIM5_CC3 : 
            return {5, TIM5, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM5_CC4
		case PWM_TIM5_CC4 : 
            return {5, TIM5, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM6_CC1
		case PWM_TIM6_CC1 : 
            return {6, TIM6, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM6_CC2
		case PWM_TIM6_CC2 : 
            return {6, TIM6, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM6_CC3
		case PWM_TIM6_CC3 : 
            return {6, TIM6, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM6_CC4
		case PWM_TIM6_CC4 : 
            return {6, TIM6, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM7_CC1
		case PWM_TIM7_CC1 : 
            return {7, TIM7, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM7_CC2
		case PWM_TIM7_CC2 : 
            return {7, TIM7, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM7_CC3
		case PWM_TIM7_CC3 : 
            return {7, TIM7, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM7_CC4
		case PWM_TIM7_CC4 : 
            return {7, TIM7, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM8_CC1
		case PWM_TIM8_CC1 : 
            return {8, TIM8, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM8_CC2
		case PWM_TIM8_CC2 : 
            return {8, TIM8, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM8_CC3
		case PWM_TIM8_CC3 : 
            return {8, TIM8, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM8_CC4
		case PWM_TIM8_CC4 : 
            return {8, TIM8, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM9_CC1
		case PWM_TIM9_CC1 : 
            return {9, TIM9, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM9_CC2
		case PWM_TIM9_CC2 : 
            return {9, TIM9, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM9_CC3
		case PWM_TIM9_CC3 : 
            return {9, TIM9, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM9_CC4
		case PWM_TIM9_CC4 : 
            return {9, TIM9, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM10_CC1
		case PWM_TIM10_CC1 : 
            return {10, TIM10, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM10_CC2
		case PWM_TIM10_CC2 : 
            return {10, TIM10, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM10_CC3
		case PWM_TIM10_CC3 : 
            return {10, TIM10, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM10_CC4
		case PWM_TIM10_CC4 : 
            return {10, TIM10, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM11_CC1
		case PWM_TIM11_CC1 : 
            return {11, TIM11, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM11_CC2
		case PWM_TIM11_CC2 : 
            return {11, TIM11, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM11_CC3
		case PWM_TIM11_CC3 : 
            return {11, TIM11, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM11_CC4
		case PWM_TIM11_CC4 : 
            return {11, TIM11, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM12_CC1
		case PWM_TIM12_CC1 : 
            return {12, TIM12, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM12_CC2
		case PWM_TIM12_CC2 : 
            return {12, TIM12, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM12_CC3
		case PWM_TIM12_CC3 : 
            return {12, TIM12, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM12_CC4
		case PWM_TIM12_CC4 : 
            return {12, TIM12, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM13_CC1
		case PWM_TIM13_CC1 : 
            return {13, TIM13, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM13_CC2
		case PWM_TIM13_CC2 : 
            return {13, TIM13, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM13_CC3
		case PWM_TIM13_CC3 : 
            return {13, TIM13, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM13_CC4
		case PWM_TIM13_CC4 : 
            return {13, TIM13, TIM_CHANNEL_4};
#endif
#ifdef PWM_TIM14_CC1
		case PWM_TIM14_CC1 : 
            return {13, TIM13, TIM_CHANNEL_1};
#endif
#ifdef PWM_TIM14_CC2
		case PWM_TIM14_CC2 : 
            return {14, TIM14, TIM_CHANNEL_2};
#endif
#ifdef PWM_TIM14_CC3
		case PWM_TIM14_CC3 : 
            return {14, TIM14, TIM_CHANNEL_3};
#endif
#ifdef PWM_TIM14_CC4
		case PWM_TIM14_CC4 : 
            return {14, TIM14, TIM_CHANNEL_4};
#endif
		}
	}

	Stm32HalPwmService *HalPwmService = 0;
	
	Stm32HalPwmService::Stm32HalPwmService()
	{
		HalPwmService = this;
	}
	
	void Stm32HalPwmService::InitPin(unsigned short pin, PinDirection direction, unsigned short minFrequency)
	{
		if (pin == 0)
			return;
					
		TimAndChannel timAndChannel = Stm32HalPwmPinToTimAndChannel(pin);
				
		EnableTimerClock(timAndChannel.TimNum);

		TIM_HandleTypeDef TIM_HandleStruct = {0};
		TIM_HandleStruct.Instance = timAndChannel.TIM;

		//set prescaler
		unsigned int clockFrequency = HAL_RCC_GetSysClockFreq();
		TIM_HandleStruct.Init.Prescaler = (clockFrequency / minFrequency) / 65535;

		if(direction == In)
		{		
			switch (timAndChannel.TimNum)
			{
	#ifdef TIM1
			case 1:
				if (TIM1_Freq_Locked && TIM1->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM1_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM2
			case 2:
				if (TIM2_Freq_Locked && TIM2->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				if(direction == Out)
					TIM2_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM3
			case 3:
				if (TIM3_Freq_Locked && TIM3->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM3_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM4
			case 4:
				if (TIM4_Freq_Locked && TIM4->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM4_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM5
			case 5:
				if (TIM5_Freq_Locked && TIM5->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM5_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM6
			case 6:
				if (TIM6_Freq_Locked && TIM6->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM6_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM7
			case 7:
				if (TIM7_Freq_Locked && TIM7->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM7_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM8
			case 8:
				if (TIM8_Freq_Locked && TIM8->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM8_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM9
			case 9:
				if (TIM9_Freq_Locked && TIM9->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM9_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM10
			case 10:
				if (TIM10_Freq_Locked && TIM10->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM10_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM11
			case 11:
				if (TIM11_Freq_Locked && TIM11->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM11_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM12
			case 12:
				if (TIM12_Freq_Locked && TIM12->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM12_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM13
			case 13:
				if (TIM13_Freq_Locked && TIM13->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM13_Freq_Locked = true;
				break;
	#endif
	#ifdef TIM14
			case 14:
				if (TIM14_Freq_Locked && TIM14->PSC != TIM_HandleStruct.Init.Prescaler)
					return;
				TIM14_Freq_Locked = true;
				break;
	#endif
			}
			EnableTimerInterrupts(timAndChannel.TimNum);
		}
		
		EnableGPIOClock(pin);
				
