FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32Hal/src/STM32HalPwmService.cpp
		//set mode
		TIM_HandleStruct.Init.CounterMode = TIM_COUNTERMODE_UP;
		TIM_HandleStruct.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
		TIM_HandleStruct.Init.Period = (int)ceil(minFrequency / (TIM_HandleStruct.Init.Prescaler+1));
  		TIM_HandleStruct.Init.Period = 0xFFFF;
  		TIM_HandleStruct.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
		
		//init
		HAL_TIM_Base_Init(&TIM_HandleStruct);

		//configure clock
		TIM_ClockConfigTypeDef TIM_ClockConfigStruct = {0};
		TIM_ClockConfigStruct.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
		HAL_TIM_ConfigClockSource(&TIM_HandleStruct, &TIM_ClockConfigStruct);

		if (direction == HardwareAbstraction::Out)
		{
			TIM_OC_InitTypeDef TIM_OC_InitStruct = {0};

			TIM_OC_InitStruct.OCMode = TIM_OCMODE_PWM1;
			TIM_OC_InitStruct.Pulse = 32767;
			TIM_OC_InitStruct.OCPolarity = TIM_OCPOLARITY_HIGH;
			TIM_OC_InitStruct.OCFastMode = TIM_OCFAST_ENABLE;
			TIM_OC_InitStruct.OCIdleState = TIM_OCIDLESTATE_RESET;
			HAL_TIM_PWM_ConfigChannel(&TIM_HandleStruct, &TIM_OC_InitStruct, timAndChannel.TIM_Channel);

			GPIO_InitTypeDef GPIO_InitStruct = {0};
			GPIO_InitStruct.Pin = PinToGPIO_Pin(pin);
			GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
			HAL_GPIO_Init(PinToGPIO(pin), &GPIO_InitStruct);

			HAL_TIM_PWM_Start(&TIM_HandleStruct, timAndChannel.TIM_Channel);
		}
		else
		{
			TIM_IC_InitTypeDef TIM_IC_InitStruct = {0};

			TIM_IC_InitStruct.ICPolarity = (timAndChannel.TIM_Channel == TIM_CHANNEL_1 || timAndChannel.TIM_Channel == TIM_CHANNEL_3)? TIM_INPUTCHANNELPOLARITY_RISING : TIM_INPUTCHANNELPOLARITY_FALLING;
			TIM_IC_InitStruct.ICSelection = TIM_ICSELECTION_DIRECTTI;
			TIM_IC_InitStruct.ICPrescaler = TIM_ICPSC_DIV1;
			TIM_IC_InitStruct.ICFilter = 0;

			HAL_TIM_IC_ConfigChannel(&TIM_HandleStruct, &TIM_IC_InitStruct, timAndChannel.TIM_Channel);

			TIM_IC_InitStruct.ICPolarity = (timAndChannel.TIM_Channel == TIM_CHANNEL_1 || timAndChannel.TIM_Channel == TIM_CHANNEL_3)? TIM_INPUTCHANNELPOLARITY_FALLING : TIM_INPUTCHANNELPOLARITY_RISING;
			TIM_IC_InitStruct.ICSelection = TIM_ICSELECTION_INDIRECTTI;

			switch(timAndChannel.TIM_Channel)
			{
				case TIM_CHANNEL_1:
					HAL_TIM_IC_ConfigChannel(&TIM_HandleStruct, &TIM_IC_InitStruct, TIM_CHANNEL_2);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC1);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC2);
					HAL_TIM_IC_Start_IT(&TIM_HandleStruct, TIM_CHANNEL_2);
					break;
				case TIM_CHANNEL_2:
					HAL_TIM_IC_ConfigChannel(&TIM_HandleStruct, &TIM_IC_InitStruct, TIM_CHANNEL_1);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC1);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC2);
					HAL_TIM_IC_Start_IT(&TIM_HandleStruct, TIM_CHANNEL_1);
					break;
				case TIM_CHANNEL_3:
					HAL_TIM_IC_ConfigChannel(&TIM_HandleStruct, &TIM_IC_InitStruct, TIM_CHANNEL_4);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC3);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC4);
					HAL_TIM_IC_Start_IT(&TIM_HandleStruct, TIM_CHANNEL_4);
					break;
				case TIM_CHANNEL_4:
					HAL_TIM_IC_ConfigChannel(&TIM_HandleStruct, &TIM_IC_InitStruct, TIM_CHANNEL_3);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC3);
					__HAL_TIM_ENABLE_IT(&TIM_HandleStruct, TIM_IT_CC4);
					HAL_TIM_IC_Start_IT(&TIM_HandleStruct, TIM_CHANNEL_3);
					break;
			}
			HAL_TIM_IC_Start_IT(&TIM_HandleStruct, timAndChannel.TIM_Channel);
			
			GPIO_InitTypeDef GPIO_InitStruct = {0};
			GPIO_InitStruct.Pin = PinToGPIO_Pin(pin);
			GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
			HAL_GPIO_Init(PinToGPIO(pin), &GPIO_InitStruct);
		}
	}
		
	PwmValue Stm32HalPwmService::ReadPin(unsigned short pin)
	{
		PwmValue value = PwmValue();
		if (pin == 0)
			return value;
		
		TimAndChannel timAndChannel = Stm32HalPwmPinToTimAndChannel(pin);

		unsigned char timerMinus1 = timAndChannel.TimNum - 1;
		unsigned char iCMinus1 = 0;
		unsigned char iCMinus1Neg = 0;
		
		switch(timAndChannel.TIM_Channel)
		{
			case TIM_CHANNEL_1:
				iCMinus1 = 0;
				iCMinus1Neg = 1;
				break;
			case TIM_CHANNEL_2:
				iCMinus1 = 1;
				iCMinus1Neg = 2;
				break;
			case TIM_CHANNEL_3:
				iCMinus1 = 2;
				iCMinus1Neg = 3;
				break;
			case TIM_CHANNEL_4:
				iCMinus1 = 3;
				iCMinus1Neg = 2;
				break;
		}

		int pulseTick = (int)_currCC[timerMinus1][iCMinus1Neg] - _currCC[timerMinus1][iCMinus1];
		if(pulseTick < 0)
			pulseTick = (int)_currCC[timerMinus1][iCMinus1Neg] - _prevCC[timerMinus1][iCMinus1];
		if (pulseTick < 0)
			pulseTick = ((int)_currCC[timerMinus1][iCMinus1Neg] - _currCC[timerMinus1][iCMinus1]) + 65535;
		unsigned short periodTick = _currCC[timerMinus1][iCMinus1] - _prevCC[timerMinus1][iCMinus1];
				
		float clockFactor = ((float)(timAndChannel.TIM->PSC + 1)) / HAL_RCC_GetSysClockFreq();

		value.PulseWidth = pulseTick * clockFactor;
		value.Period = periodTick * clockFactor;
		
		return value;
	}
	
	void Stm32HalPwmService::WritePin(unsigned short pin, HardwareAbstraction::PwmValue value)
	{
		if (pin == 0)
			return;
		
		TimAndChannel timAndChannel = Stm32HalPwmPinToTimAndChannel(pin);
				
		if (!(
#ifdef TIM1
			(timAndChannel.TimNum == 1 && (TIM1_Freq_Locked || TIM1_Input))
#endif
#ifdef TIM2
			|| (timAndChannel.TimNum == 2 && (TIM2_Freq_Locked || TIM2_Input)) 
#endif
#ifdef TIM3
			|| (timAndChannel.TimNum == 3 && (TIM3_Freq_Locked || TIM1_Input)) 
#endif
#ifdef TIM4
			|| (timAndChannel.TimNum == 4 && (TIM4_Freq_Locked || TIM4_Input)))
#endif
#ifdef TIM5
			|| (timAndChannel.TimNum == 5 && (TIM5_Freq_Locked || TIM5_Input)))
#endif
#ifdef TIM6
			|| (timAndChannel.TimNum == 6 && (TIM6_Freq_Locked || TIM6_Input)))
#endif
#ifdef TIM7
			|| (timAndChannel.TimNum == 7 && (TIM7_Freq_Locked || TIM7_Input)))
#endif
#ifdef TIM8
			|| (timAndChannel.TimNum == 8 && (TIM8_Freq_Locked || TIM8_Input)))
#endif
#ifdef TIM9
			|| (timAndChannel.TimNum == 9 && (TIM9_Freq_Locked || TIM9_Input)))
#endif
#ifdef TIM10
			|| (timAndChannel.TimNum == 10 && (TIM10_Freq_Locked || TIM10_Input)))
#endif
#ifdef TIM11
			|| (timAndChannel.TimNum == 11 && (TIM11_Freq_Locked || TIM11_Input)))
#endif
#ifdef TIM12
			|| (timAndChannel.TimNum == 12 && (TIM12_Freq_Locked || TIM12_Input)))
#endif
#ifdef TIM13
			|| (timAndChannel.TimNum == 13 && (TIM13_Freq_Locked || TIM13_Input)))
#endif
#ifdef TIM14
			|| (timAndChannel.TimNum == 14 && (TIM14_Freq_Locked || TIM14_Input)))
#endif
			)
		{
			//Set period
			unsigned int clockFrequency = HAL_RCC_GetSysClockFreq();
			timAndChannel.TIM->PSC = (clockFrequency * value.Period) / 65535;
			timAndChannel.TIM->ARR = (int)ceil((clockFrequency * value.Period) / (timAndChannel.TIM->PSC+1));
		}

