FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32Hal/src/STM32HalPwmService.cpp
		//set pulse width
		switch (timAndChannel.TIM_Channel)
		{
		case TIM_CHANNEL_1:
			timAndChannel.TIM->CCR1 = timAndChannel.TIM->ARR * (value.PulseWidth / value.Period);
			break;
		case TIM_CHANNEL_2:
			timAndChannel.TIM->CCR2 = timAndChannel.TIM->ARR * (value.PulseWidth / value.Period);
			break;
		case TIM_CHANNEL_3:
			timAndChannel.TIM->CCR3 = timAndChannel.TIM->ARR * (value.PulseWidth / value.Period);
			break;
		case TIM_CHANNEL_4:
			timAndChannel.TIM->CCR4 = timAndChannel.TIM->ARR * (value.PulseWidth / value.Period);
		}
	}
	
#ifdef TIM1
	void Stm32HalPwmService::InterruptTim1()
	{
		if (TIM1->SR & TIM_IT_CC1)
		{
			_prevCC[0][0] = _currCC[0][0];
			_currCC[0][0] = TIM1->CCR1;
			TIM1->SR = ~TIM_IT_CC1;
		}
		if (TIM1->SR & TIM_IT_CC2)
		{
			_prevCC[0][1] = _currCC[0][1];
			_currCC[0][1] = TIM1->CCR2;
			TIM1->SR = ~TIM_IT_CC2;
		}
		if (TIM1->SR & TIM_IT_CC3)
		{
			_prevCC[0][2] = _currCC[0][2];
			_currCC[0][2] = TIM1->CCR3;
			TIM1->SR = ~TIM_IT_CC3;
		}
		if (TIM1->SR & TIM_IT_CC4)
		{
			_prevCC[0][3] = _currCC[0][3];
			_currCC[0][3] = TIM1->CCR4;
			TIM1->SR = ~TIM_IT_CC4;
		}
	}
#endif
	
#ifdef TIM2
	void Stm32HalPwmService::InterruptTim2()
	{
		if (TIM2->SR & TIM_IT_CC1)
		{
			_prevCC[1][0] = _currCC[1][0];
			_currCC[1][0] = TIM2->CCR1;
			TIM2->SR = ~TIM_IT_CC1;
		}
		if (TIM2->SR & TIM_IT_CC2)
		{
			_prevCC[1][1] = _currCC[1][1];
			_currCC[1][1] = TIM2->CCR2;
			TIM2->SR = ~TIM_IT_CC2;
		}
		if (TIM2->SR & TIM_IT_CC3)
		{
			_prevCC[1][2] = _currCC[1][2];
			_currCC[1][2] = TIM2->CCR3;
			TIM2->SR = ~TIM_IT_CC3;
		}
		if (TIM2->SR & TIM_IT_CC4)
		{
			_prevCC[1][3] = _currCC[1][3];
			_currCC[1][3] = TIM2->CCR4;
			TIM2->SR = ~TIM_IT_CC4;
		}
	}
#endif
	
#ifdef TIM3
	void Stm32HalPwmService::InterruptTim3()
	{
		if (TIM3->SR & TIM_IT_CC1)
		{
			_prevCC[2][0] = _currCC[2][0];
			_currCC[2][0] = TIM3->CCR1;
			TIM3->SR = ~TIM_IT_CC1;
		}
		if (TIM3->SR & TIM_IT_CC2)
		{
			_prevCC[2][1] = _currCC[2][1];
			_currCC[2][1] = TIM3->CCR2;
			TIM3->SR = ~TIM_IT_CC2;
		}
		if (TIM3->SR & TIM_IT_CC3)
		{
			_prevCC[2][2] = _currCC[2][2];
			_currCC[2][2] = TIM3->CCR3;
			TIM3->SR = ~TIM_IT_CC3;
		}
		if (TIM3->SR & TIM_IT_CC4)
		{
			_prevCC[2][3] = _currCC[2][3];
			_currCC[2][3] = TIM3->CCR4;
			TIM3->SR = ~TIM_IT_CC4;
		}
	}
#endif
	
#ifdef TIM4
	void Stm32HalPwmService::InterruptTim4()
	{
		if (TIM4->SR & TIM_IT_CC1)
		{
			_prevCC[3][0] = _currCC[3][0];
			_currCC[3][0] = TIM4->CCR1;
			TIM4->SR = ~TIM_IT_CC1;
		}
		if (TIM4->SR & TIM_IT_CC2)
		{
			_prevCC[3][1] = _currCC[3][1];
			_currCC[3][1] = TIM4->CCR2;
			TIM4->SR = ~TIM_IT_CC2;
		}
		if (TIM4->SR & TIM_IT_CC3)
		{
			_prevCC[3][2] = _currCC[3][2];
			_currCC[3][2] = TIM4->CCR3;
			TIM4->SR = ~TIM_IT_CC3;
		}
		if (TIM4->SR & TIM_IT_CC4)
		{
			_prevCC[3][3] = _currCC[3][3];
			_currCC[3][3] = TIM4->CCR4;
			TIM4->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM5
	void Stm32HalPwmService::InterruptTim5()
	{
		if (TIM5->SR & TIM_IT_CC1)
		{
			_prevCC[4][0] = _currCC[4][0];
			_currCC[4][0] = TIM5->CCR1;
			TIM5->SR = ~TIM_IT_CC1;
		}
		if (TIM5->SR & TIM_IT_CC2)
		{
			_prevCC[4][1] = _currCC[4][1];
			_currCC[4][1] = TIM5->CCR2;
			TIM5->SR = ~TIM_IT_CC2;
		}
		if (TIM5->SR & TIM_IT_CC3)
		{
			_prevCC[4][2] = _currCC[4][2];
			_currCC[4][2] = TIM5->CCR3;
			TIM5->SR = ~TIM_IT_CC3;
		}
		if (TIM5->SR & TIM_IT_CC4)
		{
			_prevCC[4][3] = _currCC[4][3];
			_currCC[4][3] = TIM5->CCR4;
			TIM5->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM6
	void Stm32HalPwmService::InterruptTIM6()
	{
		if (TIM6->SR & TIM_IT_CC1)
		{
			_prevCC[5][0] = _currCC[5][0];
			_currCC[5][0] = TIM6->CCR1;
			TIM6->SR = ~TIM_IT_CC1;
		}
		if (TIM6->SR & TIM_IT_CC2)
		{
			_prevCC[5][1] = _currCC[5][1];
			_currCC[5][1] = TIM6->CCR2;
			TIM6->SR = ~TIM_IT_CC2;
		}
		if (TIM6->SR & TIM_IT_CC3)
		{
			_prevCC[5][2] = _currCC[5][2];
			_currCC[5][2] = TIM6->CCR3;
			TIM6->SR = ~TIM_IT_CC3;
		}
		if (TIM6->SR & TIM_IT_CC4)
		{
			_prevCC[5][3] = _currCC[5][3];
			_currCC[5][3] = TIM6->CCR4;
			TIM6->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM7
	void Stm32HalPwmService::InterruptTIM7()
	{
		if (TIM7->SR & TIM_IT_CC1)
		{
			_prevCC[6][0] = _currCC[6][0];
			_currCC[6][0] = TIM7->CCR1;
			TIM7->SR = ~TIM_IT_CC1;
		}
		if (TIM7->SR & TIM_IT_CC2)
		{
			_prevCC[6][1] = _currCC[6][1];
			_currCC[6][1] = TIM7->CCR2;
			TIM7->SR = ~TIM_IT_CC2;
		}
		if (TIM7->SR & TIM_IT_CC3)
		{
			_prevCC[6][2] = _currCC[6][2];
			_currCC[6][2] = TIM7->CCR3;
			TIM7->SR = ~TIM_IT_CC3;
		}
		if (TIM7->SR & TIM_IT_CC4)
		{
			_prevCC[6][3] = _currCC[6][3];
			_currCC[6][3] = TIM7->CCR4;
			TIM7->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM8
	void Stm32HalPwmService::InterruptTIM8()
	{
		if (TIM8->SR & TIM_IT_CC1)
		{
			_prevCC[7][0] = _currCC[7][0];
			_currCC[7][0] = TIM8->CCR1;
			TIM8->SR = ~TIM_IT_CC1;
		}
		if (TIM8->SR & TIM_IT_CC2)
		{
			_prevCC[7][1] = _currCC[7][1];
			_currCC[7][1] = TIM8->CCR2;
			TIM8->SR = ~TIM_IT_CC2;
		}
		if (TIM8->SR & TIM_IT_CC3)
		{
			_prevCC[7][2] = _currCC[7][2];
			_currCC[7][2] = TIM8->CCR3;
			TIM8->SR = ~TIM_IT_CC3;
		}
		if (TIM8->SR & TIM_IT_CC4)
		{
			_prevCC[7][3] = _currCC[7][3];
			_currCC[7][3] = TIM8->CCR4;
			TIM8->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM9
	void Stm32HalPwmService::InterruptTIM9()
	{
		if (TIM9->SR & TIM_IT_CC1)
		{
			_prevCC[8][0] = _currCC[8][0];
			_currCC[8][0] = TIM9->CCR1;
			TIM9->SR = ~TIM_IT_CC1;
		}
		if (TIM9->SR & TIM_IT_CC2)
		{
			_prevCC[8][1] = _currCC[8][1];
			_currCC[8][1] = TIM9->CCR2;
			TIM9->SR = ~TIM_IT_CC2;
		}
		if (TIM9->SR & TIM_IT_CC3)
		{
			_prevCC[8][2] = _currCC[8][2];
			_currCC[8][2] = TIM9->CCR3;
			TIM9->SR = ~TIM_IT_CC3;
		}
		if (TIM9->SR & TIM_IT_CC4)
		{
			_prevCC[8][3] = _currCC[8][3];
			_currCC[8][3] = TIM9->CCR4;
			TIM9->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM10
	void Stm32HalPwmService::InterruptTIM10()
	{
		if (TIM10->SR & TIM_IT_CC1)
		{
			_prevCC[9][0] = _currCC[9][0];
			_currCC[9][0] = TIM10->CCR1;
			TIM10->SR = ~TIM_IT_CC1;
		}
		if (TIM10->SR & TIM_IT_CC2)
		{
			_prevCC[9][1] = _currCC[9][1];
			_currCC[9][1] = TIM10->CCR2;
			TIM10->SR = ~TIM_IT_CC2;
		}
		if (TIM10->SR & TIM_IT_CC3)
		{
			_prevCC[9][2] = _currCC[9][2];
			_currCC[9][2] = TIM10->CCR3;
			TIM10->SR = ~TIM_IT_CC3;
		}
		if (TIM10->SR & TIM_IT_CC4)
		{
			_prevCC[9][3] = _currCC[9][3];
			_currCC[9][3] = TIM10->CCR4;
			TIM10->SR = ~TIM_IT_CC4;
		}
	}
#endif

