FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32Hal/src/STM32HalPwmService.cpp
#ifdef TIM11
	void Stm32HalPwmService::InterruptTIM11()
	{
		if (TIM11->SR & TIM_IT_CC1)
		{
			_prevCC[10][0] = _currCC[10][0];
			_currCC[10][0] = TIM11->CCR1;
			TIM11->SR = ~TIM_IT_CC1;
		}
		if (TIM11->SR & TIM_IT_CC2)
		{
			_prevCC[10][1] = _currCC[10][1];
			_currCC[10][1] = TIM11->CCR2;
			TIM11->SR = ~TIM_IT_CC2;
		}
		if (TIM11->SR & TIM_IT_CC3)
		{
			_prevCC[10][2] = _currCC[10][2];
			_currCC[10][2] = TIM11->CCR3;
			TIM11->SR = ~TIM_IT_CC3;
		}
		if (TIM11->SR & TIM_IT_CC4)
		{
			_prevCC[10][3] = _currCC[10][3];
			_currCC[10][3] = TIM11->CCR4;
			TIM11->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM12
	void Stm32HalPwmService::InterruptTIM12()
	{
		if (TIM12->SR & TIM_IT_CC1)
		{
			_prevCC[11][0] = _currCC[11][0];
			_currCC[11][0] = TIM12->CCR1;
			TIM12->SR = ~TIM_IT_CC1;
		}
		if (TIM12->SR & TIM_IT_CC2)
		{
			_prevCC[11][1] = _currCC[11][1];
			_currCC[11][1] = TIM12->CCR2;
			TIM12->SR = ~TIM_IT_CC2;
		}
		if (TIM12->SR & TIM_IT_CC3)
		{
			_prevCC[11][2] = _currCC[11][2];
			_currCC[11][2] = TIM12->CCR3;
			TIM12->SR = ~TIM_IT_CC3;
		}
		if (TIM12->SR & TIM_IT_CC4)
		{
			_prevCC[11][3] = _currCC[11][3];
			_currCC[11][3] = TIM12->CCR4;
			TIM12->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM13
	void Stm32HalPwmService::InterruptTIM13()
	{
		if (TIM13->SR & TIM_IT_CC1)
		{
			_prevCC[12][0] = _currCC[12][0];
			_currCC[12][0] = TIM13->CCR1;
			TIM13->SR = ~TIM_IT_CC1;
		}
		if (TIM13->SR & TIM_IT_CC2)
		{
			_prevCC[12][1] = _currCC[12][1];
			_currCC[12][1] = TIM13->CCR2;
			TIM13->SR = ~TIM_IT_CC2;
		}
		if (TIM13->SR & TIM_IT_CC3)
		{
			_prevCC[12][2] = _currCC[12][2];
			_currCC[12][2] = TIM13->CCR3;
			TIM13->SR = ~TIM_IT_CC3;
		}
		if (TIM13->SR & TIM_IT_CC4)
		{
			_prevCC[12][3] = _currCC[12][3];
			_currCC[12][3] = TIM13->CCR4;
			TIM13->SR = ~TIM_IT_CC4;
		}
	}
#endif

#ifdef TIM14
	void Stm32HalPwmService::InterruptTIM14()
	{
		if (TIM14->SR & TIM_IT_CC1)
		{
			_prevCC[13][0] = _currCC[13][0];
			_currCC[13][0] = TIM14->CCR1;
			TIM14->SR = ~TIM_IT_CC1;
		}
		if (TIM14->SR & TIM_IT_CC2)
		{
			_prevCC[13][1] = _currCC[13][1];
			_currCC[13][1] = TIM14->CCR2;
			TIM14->SR = ~TIM_IT_CC2;
		}
		if (TIM14->SR & TIM_IT_CC3)
		{
			_prevCC[13][2] = _currCC[13][2];
			_currCC[13][2] = TIM14->CCR3;
			TIM14->SR = ~TIM_IT_CC3;
		}
		if (TIM14->SR & TIM_IT_CC4)
		{
			_prevCC[13][3] = _currCC[13][3];
			_currCC[13][3] = TIM14->CCR4;
			TIM14->SR = ~TIM_IT_CC4;
		}
	}
#endif
}